import {v1} from "uuid";

export const DATA_STATE = [
    {
        id: '1',
        name: 'Мясная продукция',
        categories: [
            {
                id: '1.1',
                name: 'Вареные колбасные изделия',
                list: [
                    {
                        id: '1.1.1',
                        name: 'Докторская" категории А ГОСТ, в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: 'Докторская" категории А ГОСТ, в/с',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.2',
                        name: '"Березинская по-Волковысски классик" (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.3',
                        name: '"Докторская по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.4',
                        name: '"Знатная классик", в/с (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.5',
                        name: '"Ласунак по-Волковысски классик" в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.6',
                        name: '"Любимая по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.7',
                        name: '"Молодежная по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.8',
                        name: '"Молочная по-Волковысски гранд", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.9',
                        name: '"Молочная по-Волковысски гранд", в/с (фикс.вес 0,45 кг)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.10',
                        name: '"Мортаделла по-Волковысски классик", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                ]
            },
            {
                id: '1.2',
                name: 'Сосиски',
                list: [
                    {
                        id: '1.1.1',
                        name: 'Докторская" категории А ГОСТ, в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: 'Докторская" категории А ГОСТ, в/с',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.2',
                        name: '"Березинская по-Волковысски классик" (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.3',
                        name: '"Докторская по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.4',
                        name: '"Знатная классик", в/с (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.5',
                        name: '"Ласунак по-Волковысски классик" в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.6',
                        name: '"Любимая по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.7',
                        name: '"Молодежная по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.8',
                        name: '"Молочная по-Волковысски гранд", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.9',
                        name: '"Молочная по-Волковысски гранд", в/с (фикс.вес 0,45 кг)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.10',
                        name: '"Мортаделла по-Волковысски классик", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                ]
            },
            {
                id: '1.3',
                name: 'Ветчина',
                list: [
                    {
                        id: '1.1.1',
                        name: 'Докторская" категории А ГОСТ, в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: 'Докторская" категории А ГОСТ, в/с',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.2',
                        name: '"Березинская по-Волковысски классик" (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.3',
                        name: '"Докторская по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.4',
                        name: '"Знатная классик", в/с (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.5',
                        name: '"Ласунак по-Волковысски классик" в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.6',
                        name: '"Любимая по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.7',
                        name: '"Молодежная по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.8',
                        name: '"Молочная по-Волковысски гранд", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.9',
                        name: '"Молочная по-Волковысски гранд", в/с (фикс.вес 0,45 кг)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.10',
                        name: '"Мортаделла по-Волковысски классик", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                ]
            },
            {
                id: '1.4',
                name: 'Копченые колбасные изделия',
                list: [
                    {
                        id: '1.1.1',
                        name: 'Докторская" категории А ГОСТ, в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: 'Докторская" категории А ГОСТ, в/с',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.2',
                        name: '"Березинская по-Волковысски классик" (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.3',
                        name: '"Докторская по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.4',
                        name: '"Знатная классик", в/с (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.5',
                        name: '"Ласунак по-Волковысски классик" в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.6',
                        name: '"Любимая по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.7',
                        name: '"Молодежная по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.8',
                        name: '"Молочная по-Волковысски гранд", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.9',
                        name: '"Молочная по-Волковысски гранд", в/с (фикс.вес 0,45 кг)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.10',
                        name: '"Мортаделла по-Волковысски классик", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                ]
            },
        ]
    },
    {
        id: '2',
        name: 'Молочная продукция',
        categories: [
            {
                id: v1(),
                name: 'Масло сладкосливочное',
                list: [
                    {
                        id: '2.1.1',
                        name: 'Докторская" категории А ГОСТ, в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: 'Докторская" категории А ГОСТ, в/с',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.2',
                        name: '"Березинская по-Волковысски классик" (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.3',
                        name: '"Докторская по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.4',
                        name: '"Знатная классик", в/с (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.5',
                        name: '"Ласунак по-Волковысски классик" в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.6',
                        name: '"Любимая по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.7',
                        name: '"Молодежная по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.8',
                        name: '"Молочная по-Волковысски гранд", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.9',
                        name: '"Молочная по-Волковысски гранд", в/с (фикс.вес 0,45 кг)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.10',
                        name: '"Мортаделла по-Волковысски классик", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                ]
            },
            {
                id: v1(),
                name: 'Молоко',
                list: [
                    {
                        id: '1.1.1',
                        name: 'Докторская" категории А ГОСТ, в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: 'Докторская" категории А ГОСТ, в/с',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.2',
                        name: '"Березинская по-Волковысски классик" (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.3',
                        name: '"Докторская по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.4',
                        name: '"Знатная классик", в/с (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.5',
                        name: '"Ласунак по-Волковысски классик" в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.6',
                        name: '"Любимая по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.7',
                        name: '"Молодежная по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.8',
                        name: '"Молочная по-Волковысски гранд", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.9',
                        name: '"Молочная по-Волковысски гранд", в/с (фикс.вес 0,45 кг)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.10',
                        name: '"Мортаделла по-Волковысски классик", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                ]
            },
            {
                id: v1(),
                name: 'Кефир',
                list: [
                    {
                        id: '1.1.1',
                        name: 'Докторская" категории А ГОСТ, в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: 'Докторская" категории А ГОСТ, в/с',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.2',
                        name: '"Березинская по-Волковысски классик" (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.3',
                        name: '"Докторская по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.4',
                        name: '"Знатная классик", в/с (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.5',
                        name: '"Ласунак по-Волковысски классик" в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.6',
                        name: '"Любимая по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.7',
                        name: '"Молодежная по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.8',
                        name: '"Молочная по-Волковысски гранд", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.9',
                        name: '"Молочная по-Волковысски гранд", в/с (фикс.вес 0,45 кг)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.10',
                        name: '"Мортаделла по-Волковысски классик", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                ]
            },
            {
                id: v1(),
                name: 'Творог',
                list: [
                    {
                        id: '1.1.1',
                        name: 'Докторская" категории А ГОСТ, в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: 'Докторская" категории А ГОСТ, в/с',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.2',
                        name: '"Березинская по-Волковысски классик" (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.3',
                        name: '"Докторская по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.4',
                        name: '"Знатная классик", в/с (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.5',
                        name: '"Ласунак по-Волковысски классик" в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.6',
                        name: '"Любимая по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.7',
                        name: '"Молодежная по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.8',
                        name: '"Молочная по-Волковысски гранд", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.9',
                        name: '"Молочная по-Волковысски гранд", в/с (фикс.вес 0,45 кг)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.10',
                        name: '"Мортаделла по-Волковысски классик", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                ]
            },
        ]
    },
    {
        id: '3',
        name: 'Товары для детей',
        categories: [
            {
                id: v1(),
                name: 'Детское пюре',
                list: [
                    {
                        id: '2.1.1',
                        name: 'Докторская" категории А ГОСТ, в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: 'Докторская" категории А ГОСТ, в/с',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.2',
                        name: '"Березинская по-Волковысски классик" (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.3',
                        name: '"Докторская по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.4',
                        name: '"Знатная классик", в/с (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.5',
                        name: '"Ласунак по-Волковысски классик" в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.6',
                        name: '"Любимая по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.7',
                        name: '"Молодежная по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.8',
                        name: '"Молочная по-Волковысски гранд", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.9',
                        name: '"Молочная по-Волковысски гранд", в/с (фикс.вес 0,45 кг)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.10',
                        name: '"Мортаделла по-Волковысски классик", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                ]
            },
            {
                id: v1(),
                name: 'Детское питание',
                list: [
                    {
                        id: '1.1.1',
                        name: 'Докторская" категории А ГОСТ, в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: 'Докторская" категории А ГОСТ, в/с',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.2',
                        name: '"Березинская по-Волковысски классик" (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.3',
                        name: '"Докторская по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.4',
                        name: '"Знатная классик", в/с (газ)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.5',
                        name: '"Ласунак по-Волковысски классик" в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.6',
                        name: '"Любимая по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.7',
                        name: '"Молодежная по-Волковысски", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.8',
                        name: '"Молочная по-Волковысски гранд", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.9',
                        name: '"Молочная по-Волковысски гранд", в/с (фикс.вес 0,45 кг)',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                    {
                        id: '1.1.10',
                        name: '"Мортаделла по-Волковысски классик", в/с',
                        fields: [
                            {
                                name: 'Наименование продукции',
                                value: '"Березинская по-Волковысски классик" (газ)',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Артикул',
                                value: '904385039',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Описание',
                                value: 'какойто текст',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Производитель',
                                value: 'ООО "Импорт гарант"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Страна происхождения',
                                value: 'Россия',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Марка, Бренд',
                                value: 'ООО "Бренд"',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Тип',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Срок годности: дн, мес',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Вес: гр, кг и т.п.',
                                value: 'какое то значение',
                                id: v1(),
                                main: 1
                            },
                            {
                                name: 'Энергетическая ценность',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Белки, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Жиры,г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Углеводы, г',
                                value: 'какое то значение',
                                id: v1(),
                                main: 2
                            },
                            {
                                name: 'Комплектация',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Стандарт производства',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Тип питания',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Состав',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Упаковка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Оболочка',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },
                            {
                                name: 'Сырье',
                                value: 'какое то значение',
                                id: v1(),
                                main: 3
                            },

                        ]
                    },
                ]
            },
        ]
    },
]

